{
  "_name_or_path": "google/mobilebert-uncased",
  "architectures": [
    "MobileBertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_activation": false,
  "classifier_dropout": null,
  "embedding_size": 128,
  "hidden_act": "relu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 512,
  "id2label": {
    "0": "B-action",
    "1": "B-date",
    "2": "B-endTime",
    "3": "B-location",
    "4": "B-startTime",
    "5": "B-title",
    "6": "I-date",
    "7": "I-description",
    "8": "I-endTime",
    "9": "I-location",
    "10": "I-startTime",
    "11": "I-title",
    "12": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 512,
  "intra_bottleneck_size": 128,
  "key_query_shared_bottleneck": true,
  "label2id": {
    "B-action": 0,
    "B-date": 1,
    "B-endTime": 2,
    "B-location": 3,
    "B-startTime": 4,
    "B-title": 5,
    "I-date": 6,
    "I-description": 7,
    "I-endTime": 8,
    "I-location": 9,
    "I-startTime": 10,
    "I-title": 11,
    "O": 12
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "mobilebert",
  "normalization_type": "no_norm",
  "num_attention_heads": 4,
  "num_feedforward_networks": 4,
  "num_hidden_layers": 24,
  "pad_token_id": 0,
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "trigram_input": true,
  "true_hidden_size": 128,
  "type_vocab_size": 2,
  "use_bottleneck": true,
  "use_bottleneck_attention": false,
  "vocab_size": 30522
}
